# RebarCoupler Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
NumberingSchemaTypes..::..StructuralNumberingSchemas..::..RebarCoupler Property
NumberingSchemaTypes..::..StructuralNumberingSchemas Class See Also
---
Built-in schema used for numbering rebar coupler elements
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static NumberingSchemaType RebarCoupler { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarCoupler As NumberingSchemaType
	Get
```

Visual C++
---
```text
public:
static property NumberingSchemaType^ RebarCoupler {
	NumberingSchemaType^ get ();
}
```

# See Also
NumberingSchemaTypes..::..StructuralNumberingSchemas Class
Autodesk.Revit.DB Namespace